[
    {
    "name": "Google",
    "meta": "popular",
    "url": "https://takeout.google.com/",
    "difficulty": "easy",
    "notes_en": "Go to https://takeout.google.com/ logged in a Google Account and select the data from every Google Service you need/want and click \"Next Step\". Then you can choose between export now or once every 2 months for 1 year, the file type and size. Click \"Create Export\" and wait until the process is finished. Then, just download your data.",
    "notes_es": "Ve a https://takeout.google.com/, inicia sesión con tu cuenta de Google, selecciona los servicios que necesites. Puedes elegir entre exportar ahora o exportar cada 2 meses durante un año."
},
    {
    "name": "Reddit",
    "meta": "popular",
    "url": "https://www.reddit.com/settings/data-request",
    "difficulty": "easy",
    "notes_en": "Go to https://www.reddit.com/settings/data-request while being logged in Reddit. Once there, click on getting the data from a range of time or all. Then, wait for the private message in reddit, click in \"Download here\" and we are done. WARNING: you can only do a data request once every 30 days.",
    "notes_es": "Ve a https://www.reddit.com/settings/data-request tras haber iniciado sesión en Reddit. Dese ahí, puedes obtener tus datos desde un intervalo de tiempo o todos los datos. Recibirás un mensaje privado con el que podrás descargar los datos."
},
    {
    "name": "Telegram",
    "url": "https://t.me/gdprbot",
    "difficulty": "easy",
    "notes_en": "The bot (https://t.me/gdprbot) in Telegram show us how to obtain our data in the app. The use of Telegram Desktop is needed in order to get the data. Once there, go to options, settings, advanced, export Telegram data, choose everything you want/need and export it in HTML or JSON format.",
    "notes_es": "El bot @gdprbot nos guía en el proceso de obtención de datos. Es necesario usar Telegram Desktop. Ve a \"Opciones\", \"Configuración\", \"Avanzado\" y en \"Exportar datos de Telegram\", puedes elegir los datos que necesites, en formato HTML o JSON."
},
    {
    "name": "Aliexpress",
    "url": "https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in 'https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'",
    "notes_es": "Dependiendo de donde vivas tendrás que seguir unas instrucciones u otras de https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm"
},
    {
    "name": "1688",
    "url": "https://1688.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'",
    "notes_es": "Dependiendo de donde vivas tendrás que seguir unas instrucciones u otras de https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm"
},
    {
    "name": "Alibaba",
    "url": "https://alibaba.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'",
    "notes_es": "Dependiendo de donde vivas tendrás que seguir unas instrucciones u otras de https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm"
},
    {
    "name": "Taobao",
    "url": "https://taobao.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'",
    "notes_es": "Dependiendo de donde vivas tendrás que seguir unas instrucciones u otras de https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm"
},
    {
    "name": "Tmall",
    "url": "https://tmall.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'",
    "notes_es": "Dependiendo de donde vivas tendrás que seguir unas instrucciones u otras de https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm"
},
    {
    "name": "Steam",
    "url": "https://steamcommunity.com/",
    "difficulty": "medium",
    "notes_en": "In most cases, you can access, manage, or delete Personal Data in the Privacy Dashboard, but you may also contact Valve with questions or requests by summiting a support ticket.",
    "notes_es": "En la mayoría de casos, puedes acceder y borrar tus datos personales en el Panel de Privacidad, pero puedes contactar con Valve si tienes problemas o preguntas mediante un ticket de soporte"
},
    {
    "name": "PcComponentes",
    "url": "https://www.pccomponentes.com/",
    "difficulty": "hard",
    "notes_en": "You will have to send a written request with your passport, or another identification document, to  Av. Europa Parcela 2-3, Pol. Ind. Las Salinas 30840 Alhama de Murcia. You can also request the data throught a e-mail to lopd@pccomponentes.com.",
    "notes_es": "Tienes que enviar una solicitud escrita con un documento identificativo a Av. Europa, Parcela 2-3, Pol. Ind. Las Salinas 30840 Alhama de Murcia. También puedes realizar la petición por e-mail a lopd@pccomponentes.com"
},
    {
    "name": "Netflix",
    "url": "https://www.netflix.com/",
    "difficulty": "medium",
    "notes_en": "Go to https://www.netflix.com/account/getmyinfo and follow the instructions."
},
    {
    "name": "GitHub",
    "meta": "popular",
    "url": "https://github.com/",
    "difficulty": "medium",
    "notes_en": "Go to https://github.com/settings/admin browsing logged in to GitHub. In the section \"Export account data\" select \"Start report\". Once done, wait for an email to arrive."
},
    {
    "name": "WhatsApp",
    "meta": "popular",
    "url": "https://www.whatsapp.com/",
    "difficulty": "easy",
    "notes_en": "Open the application and go to Settings > Account > Request info. from my account. Select \"Request report \", that concludes the process. NOTICE: The report will be ready in approximately 3 days. When it is available, you will have a few weeks to download it. If you delete your account or modify the phone, the request will be canceled."
},
    {
    "name": "Instagram",
    "url": "https://www.instagram.com/",
    "difficulty": "medium",
    "notes_en": "Go to https://www.instagram.com/download/request/ browsing logged in Instagram. Select to obtain the data and later it asks for your email and password. Once done, wait for a message to arrive in the mail. WARNING: you can only do a data request once every 48 hours."
},
    {
    "name": "Linkedin",
    "url": "https://www.linkedin.com/",
    "difficulty": "easy",
    "notes_en": "1.-Click the  Me icon at the top of your LinkedIn homepage. 2.-Select Settings & Privacy from the dropdown. 3.-Click the Data Privacy on the left rail. 4.-Under the How LinkedIn uses your data section, click Get a copy of your data. 5.-Select the data that you’re looking for and Request archive."
},
    {
    "name": "Yahoo!",
    "url": "https://es.yahoo.com/",
    "difficulty": "easy",
    "notes_en": "Go to https://yahoo.mydashboard.oath.com/ with a Yahoo! account, scroll down and select 'Request a download' and on the next page you select all the data you want to download, then add an email that you want notify when the download will be ready, this process may take about 30 days."
},
    {
    "name": "Microsoft",
    "url": "https://microsoft.com/",
    "difficulty": "hard",
    "notes_en": "Not all personal data processed by Microsoft can be accessed or controlled using the tools above. If you want to access or control personal data processed by Microsoft, that the above tools are not available or directly through the Microsoft products you use, you can always contact Microsoft at the address in the section How to contact us or using our web form."
},
{
    "name": "MSI",
    "url": "https://es.msi.com/",
    "difficulty": "hard",
    "notes_en": "To exercise the right to request access to, or copies of, your Relevant Personal Data, together with information regarding the nature, Processing and disclosure of those Relevant Personal Data, or others of your rights, or to ask a question about these rights or any other provision of Privacy Policy, or about our Processing of your Personal Data, please use the contact privacy-eu@msi.com."
},
{
    "name": "GearBeast",
    "url": "https://www.gearbest.com/",
    "difficulty": "hard",
    "notes_en": "You may send us an e-mail to support@gearbest.com to exercise your rights. We will respond to your request in a reasonable timeframe. We will take all reasonable steps to ensure that your personal data is correct and up to date."
},
{
    "name": "Yoigo",
    "url": "https://www.yoigo.com/",
    "difficulty": "hard",
    "notes_en": "You must to send e-mail to datospersonales@yoigo.com with your DNI scaned by two sides with a request for what right you want to exercise."
},
{
    "name": "Twitter",
    "meta": "popular",
    "url": "https://twitter.com/",
    "difficulty": "medium",
    "notes_en": "Go to your account settings (\"Settings and privacy\"), in the \"Account\" section, click on \"Your Twitter data\", then enter your password in \"Download your Twitter data\" and then click \"Confirm \". Once the download is ready, they will send you an email to your associated email account and from there you can download a compressed file of your Twitter data."
},
{
    "name": "Universidad Complutense de Madrid",
    "url": "https://www.ucm.es/como-ejercer-los-derechos",
    "difficulty": "hard",
    "notes_en": "You have to present a request form through E-mail or in person at the registry with your ID.",
    "notes_es": "Tienes que presentar una solicitud mediante E-mail o en el registro con tu DNI."
},
{
    "name": "eBay",
    "url": "https://www.sarweb.ebay.com/sar",
    "url_es": "https://www.sarweb.ebay.com/sar",
    "difficulty": "easy",
    "notes_en": "Go to your account settings, then click on \"Request your eBay data\", follow the simple steps and in 7 days you should receive your data back",
    "notes_es": "Ve a la configuración de la cuenta, y haz click en \"Solicita tus datos de eBay\", sigue los pasos y en 7 días recibirás todos tus datos por correo electrónico"
},
{
    "name": "Tinder",
    "meta": "popular",
    "url": "https://account.gotinder.com/data",
    "difficulty": "easy",
    "notes_en": "Go to the url provided above, log-in with your account credentials and provide and e-mail to receive a link to your data",
    "notes_es": "Ve a la dirección indicada arriba, inicia sesión y da un correo electrónico en el que recibir tus datos"
},
{
    "name": "Wikipedia",
    "url": "https://www.wikipedia.org/",
    "difficulty": "impossible"
},
{
    "name": "Board Game Geek",
    "url": "https://boardgamegeek.com/privacy#toc33",
    "difficulty": "hard",
    "notes_en": "You have to contact with service support",
    "notes_es": "Debes contactar con servicio al cliente"
},
{
    "name": "PornHub",
    "url": "https://pornhub.com/information/privacy",
    "difficulty": "medium",
    "notes_en": "Go to the url provided above and click on the button 'Request a copy of my personal data', at the bottom of the page. They will send you and email to confirm the email address where they will send your data and another to verify your username and password. You will receive your data in about 24 hours.",
    "notes_es": "Entra en la dirección indicada arriba y haz click en el botón 'Request a copy of my personal data', al final de la página. Te enviarán un email para confirmar la dirección de correo electrónico donde se enviarán los datos y otro para confirmar tu usuario y contraseña. En un periodo de aproximadamente 24 horas recibiras tus datos."
},
{
    "name": "Facebook",
    "meta": "popular",
    "url": "https://www.facebook.com/help/1701730696756992",
    "difficulty": "easy",
    "notes_en": "Go to the url provided above and follow the instructions. Logging into your account, you can access a summary of your data or download a copy. The data are categorized by type to help the search and you can download it in JSON or HTML formats.",
    "notes_es": "Entra en la dirección indicada arriba y sigue las intrucciones. Entrando en tu cuenta, tienes la posibilidad de visualizar un resumen de tus datos o descargar una copia. La información esta clasificada por tipos para ayudar en la búsqueda y podrás descargarla en formato JSON o HTML."
},
{
    "name": "Apple",
    "meta": "popular",
    "url": "https://privacy.apple.com",
    "difficulty": "easy",
    "notes_en": "Go to the url provided above and login with your Apple ID. Click on 'Get a copy of my data' and categories will be displayed to select the type of data to download. After selecting, information will be asked to confirm that you are the account's owner. You will recibe a notification when the data its available for download and you will have 2 weeks to do it.",
    "notes_es": "Entra en la dirección indicada arriba e inicia sesión con tu Apple ID. Haz click en 'Obtener una copia de mis datos' y se mostrarán categorías para seleccionar el tipo de datos a descargar. Trás seleccionar, se preguntará información para confirmar que eres el propietario de la cuenta. Se te notificará cuando los datos estén disponibles para descargar y tendrás 2 semanas para hacerlo."
},
{
    "name": "ING",
    "url": "https://www.ing.com/Privacy-Statement.htm",
    "difficulty": "hard",
    "notes_en": "Go to the url provided above and in section 9 'Contact and questions', you must find the email address associated with your country. You will have to send an email to the corresponding address, stating that you want to obtain a copy of your personal data. You must provide your name, address and ID.",
    "notes_es": "Entra en la dirección indicada arriba y en la sección 9 'Contacto y preguntas', debes buscar la dirección de email asociada a tu país. Tienes que enviar un correo a la dirección correspondiente, indicando que quieres obtener una copia de tus datos personales. Debes aportar tu nombre, dirección y DNI."
}
]
