[
    {
    "name": "Google",
    "url": "https://www.google.com/",
    "difficulty": "easy",
    "notes_en": "Go to https://takeout.google.com/ logged in a Google Account and select the data from every Google Service you need/want and click \"Next Step\". Then you can choose between export now or once every 2 months for 1 year, the file type and size. Click \"Create Export\" and wait until the process is finished. Then, just download your data."
},
    {
    "name": "Reddit",
    "url": "https://www.reddit.com/",
    "difficulty": "easy",
    "notes_en": "Go to https://www.reddit.com/settings/data-request while being logged in Reddit. Once there, click on getting the data from a range of time or all. Then, wait for the private message in reddit, click in \"Download here\" and we are done. WARNING: you can only do a data request once every 30 days."
},
    {
    "name": "Telegram",
    "url": "https://telegram.org/",
    "difficulty": "easy",
    "notes_en": "The bot (https://t.me/gdprbot) in Telegram show us how to obtain our data in the app. The use of Telegram Desktop is needed in order to get the data. Once there, go to options, settings, advanced, export Telegram data, choose everything you want/need and export it in HTML or JSON format."
},
    {
    "name": "Aliexpress",
    "url": "https://aliexpress.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'."
},
    {
    "name": "1688",
    "url": "https://1688.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'."
},
    {
    "name": "Alibaba",
    "url": "https://alibaba.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'."
},
    {
    "name": "Taobao",
    "url": "https://taobao.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'."
},
    {
    "name": "Tmall",
    "url": "https://tmall.com",
    "difficulty": "hard",
    "notes_en": "Depending on you area you must follow the instructions shown in https://www.alibabagroup.com/en/contact/law_e_commerce?spm=a271m.8038972.0.0.5a916d82MwfIzm'."
},
    {
    "name": "Steam",
    "url": "https://steamcommunity.com/",
    "difficulty": "medium",
    "notes_en": "In most cases, you can access, manage, or delete Personal Data in the Privacy Dashboard, but you may also contact Valve with questions or requests by summiting a support ticket."
},
    {
    "name": "PcComponentes",
    "url": "https://www.pccomponentes.com/",
    "difficulty": "hard",
    "notes_en": "You will have to send a written request with your passport, or another identification document, to  Av. Europa Parcela 2-3, Pol. Ind. Las Salinas 30840 Alhama de Murcia. You can also request the data throught a e-mail to lopd@pccomponentes.com."
},
    {
    "name": "Netflix",
    "url": "https://www.netflix.com/",
    "difficulty": "medium",
    "notes_en": "Go to https://www.netflix.com/account/getmyinfo and follow the instructions."
},
    {
    "name": "GitHub",
    "url": "https://github.com/",
    "difficulty": "medium",
    "notes_en": "Go to https://github.com/settings/admin browsing logged in to GitHub. In the section \"Export account data\" select \"Start report\". Once done, wait for an email to arrive."
},
    {
    "name": "WhatsApp",
    "url": "https://www.whatsapp.com/",
    "difficulty": "easy",
    "notes_en": "Open the application and go to Settings > Account > Request info. from my account. Select \"Request report \", that concludes the process. NOTICE: The report will be ready in approximately 3 days. When it is available, you will have a few weeks to download it. If you delete your account or modify the phone, the request will be canceled."
},
    {
    "name": "Instagram",
    "url": "https://www.instagram.com/",
    "difficulty": "medium",
    "notes_en": "Go to https://www.instagram.com/download/request/ browsing logged in Instagram. Select to obtain the data and later it asks for your email and password. Once done, wait for a message to arrive in the mail. WARNING: you can only do a data request once every 48 hours."
},
    {
    "name": "Linkedin",
    "url": "https://www.linkedin.com/",
    "difficulty": "easy",
    "notes_en": "1.-Click the  Me icon at the top of your LinkedIn homepage. 2.-Select Settings & Privacy from the dropdown. 3.-Click the Data Privacy on the left rail. 4.-Under the How LinkedIn uses your data section, click Get a copy of your data. 5.-Select the data that you’re looking for and Request archive."
},
    {
    "name": "Yahoo!",
    "url": "https://es.yahoo.com/",
    "difficulty": "easy",
    "notes_en": "Go to https://yahoo.mydashboard.oath.com/ with a Yahoo! account, scroll down and select 'Request a download' and on the next page you select all the data you want to download, then add an email that you want notify when the download will be ready, this process may take about 30 days."
},
    {
    "name": "Microsoft",
    "url": "https://microsoft.com/",
    "difficulty": "hard",
    "notes_en": "Not all personal data processed by Microsoft can be accessed or controlled using the tools above. If you want to access or control personal data processed by Microsoft, that the above tools are not available or directly through the Microsoft products you use, you can always contact Microsoft at the address in the section How to contact us or using our web form."
},
    {
    "name": "MSI",
    "url": "https://es.msi.com/",
    "difficulty": "hard",
    "notes_en": "To exercise the right to request access to, or copies of, your Relevant Personal Data, together with information regarding the nature, Processing and disclosure of those Relevant Personal Data, or others of your rights, or to ask a question about these rights or any other provision of Privacy Policy, or about our Processing of your Personal Data, please use the contact privacy-eu@msi.com."
},
    {
    "name": "GearBeast",
    "url": "https://www.gearbest.com/",
    "difficulty": "hard",
    "notes_en": "You may send us an e-mail to support@gearbest.com to exercise your rights. We will respond to your request in a reasonable timeframe. We will take all reasonable steps to ensure that your personal data is correct and up to date."
},
    {
    "name": "Yoigo",
    "url": "https://www.yoigo.com/",
    "difficulty": "hard",
    "notes_en": "You must to send e-mail to datospersonales@yoigo.com with your DNI scaned by two sides with a request for what right you want to exercise."
}
    
]
